# #11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)

print(np.__version__)

1.3.4
1.20.3

# Mempersiapkan Data Frame

In [5]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   7  19  19  14   7
1   3   4  16   9   1
2  16   4  12  19  10
3  19   6   5  12   1
4   9  18  10  15  19
5   4   4   1  19  18
6   6   9   2  13  16
7  12  15  14  12  12
8   3  12  17  17   1
9   8  14  19   7   3

# Seleksi kolom dan baris menggunakan loc

In [7]:
df.loc[[0,3,4], ['B','E']]

    B   E
0  19   7
3   6   1
4  18  19

# Seleksi baris dengan kondisi

In [8]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
0  19  14   7
4  18  15  19
7  15  12  12
8  12  17   1
9  14   7   3

# Slicing Data Frame dengan loc

In [10]:
df.loc[0:4, 'B':'D']

    B   C   D
0  19  19  14
1   4  16   9
2   4  12  19
3   6   5  12
4  18  10  15